In [ ]:
============EDA==============
!) Pandas     : dataframe or data application
2) numpy      : Numerical python for math opertaions
3) matplotlib : For plots graphs
4) seaborn    : For plots graphs
5) bokhe      : For plots
6) plotly     : For plots

==========Mcahine learning========
1) scikit learn(sklearn) : ML models
2) stats                 : statistical models
    
============Data retrival From sql scrapping===========

1) sqlite         : connent with database 
2) Beautiful soUp : scrap the data From website
3) websocket      : scrap
==========deep learning=============

1) Tersorflow       : Google
2) Keras            : DL Models
3) Opencv           : Images operation 
4) Pillow (PIL)     : Images operation
5) pytorch          : facebook 
6) pretrained model : 
   VGG16
   MOBILENET
   RESNET
   RCNN
   MASKRCNN
   FASTERNCNN
   YOLO
============= Natural Language Process =============

1) NLTK              : Natural language process
2) scipy             : 
3) word2vec (How words will connect into vector) :
4) Glove             :
5) Worldcloud

============= Hugging face ============================

1) Transformers      : BERT(Bidirectional Encoder Representation From Tranformers)

============== GenAI Models ===========================

1) OpenAI+Micrsoft   : GPT Models
2) Google            : Gemini
3) Amzone            : Q
4) Meta Facebook     : MetaAI
5) Apple             :

LLAMA
GEMMA
Dalle-e
Ts

ALL ARE HAVING DIFFERENT DIFFERNT PACKAGES

============== Langchain =============================

1) langchain Framework

============== Deveployement / applications ==========

1) flask
2) Streamlit
3) Djong

============== Mlops =================================

!) Mlflow
2) kubeflow 
3) Azure AI service  : Azure packages
4) GCP               : GCP Packages

**Step-1**

### Create a DataFrame

- we will create a data frame using list

- we will create a dataframe using dictinoary

In [1]:
import pandas as pd

In [2]:
d1=pd.DataFrame()
d1

Empty DataFrame
Columns: []
Index: []

In [3]:
type(d1)

pandas.core.frame.DataFrame

**Step-2**

### Provide the data

In [4]:
names=['sofiyan','anas','ayan']
pd.DataFrame(names)

         0
0  sofiyan
1     anas
2     ayan

In [5]:
names=['sofiyan','anas','ayan']
age=[21,22,20]
pd.DataFrame(zip(names,age))

         0   1
0  sofiyan  21
1     anas  22
2     ayan  20

In [7]:
names=['sofiyan','anas','ayan']
age=[21,22,20]
city=['Hyd','Mumbai','Abad']
pd.DataFrame(zip(names,age,city))

         0   1       2
0  sofiyan  21     Hyd
1     anas  22  Mumbai
2     ayan  20    Abad

**Step-3**

### Provide the Column names

In [8]:
names=['sofiyan','anas','ayan']
pd.DataFrame(names,
             columns=['names'])

     names
0  sofiyan
1     anas
2     ayan

In [10]:
names=['sofiyan','anas','ayan']
age=[21,22,20]
pd.DataFrame(zip(names,age),
            columns=['names','age'])

     names  age
0  sofiyan   21
1     anas   22
2     ayan   20

**Step-4**

### Providing Index

In [13]:
names=['sofiyan','anas','ayan']
age=[21,22,20]
city=['Hyd','Mumbai','Abad']
pd.DataFrame(zip(names,age,city),
            columns=['names','age','city'],
            index=['A','B','C'])

     names  age    city
A  sofiyan   21     Hyd
B     anas   22  Mumbai
C     ayan   20    Abad

In [22]:
names=['sofiyan','anas','ayan']
age=[21,22,20]
city=['Hyd','Mumbai','Abad']
pd.DataFrame(zip(names,age),
             index=city,
            columns=['names','age'])

          names  age
Hyd     sofiyan   21
Mumbai     anas   22
Abad       ayan   20

- create a datafarme

- provide the data 

- add the columns

- provide the columns

- provide the index

**Step-5**

**Add a new colmms on existing dataframe**

In [13]:
# create a data frame
# name
# age
# city
import pandas as pd
Name=['Sofiyan','anas','ayan']
Age=[21,22,20]
City=['HYD','MUM','ABAD']
df=pd.DataFrame(zip(Name,City,Age),
            columns=['Name','Age','City'])
df

      Name   Age  City
0  Sofiyan   HYD    21
1     anas   MUM    22
2     ayan  ABAD    20

- If you want to add a new column

- Frist check how many rows are there

- For example in above dataframe we have 3 rows

- your new column also should have 3 rows 

- suppose I want to create a new column: **Salary**

- Make a list With 3 values 

- salary=[100000,200000,300000]

**syntax**:dataFrame[column]=list of values

- salary=[100000,200000,300000]

- df['salary']=salary

In [20]:
df['salary']=[]

ValueError: Length of values (0) does not match length of index (3)

In [21]:
salary=[100000,200000,300000]
df['salary']=salary
df

      Name   Age  City  salary
0  Sofiyan   HYD    21  100000
1     anas   MUM    22  200000
2     ayan  ABAD    20  300000

**use case-1**

- create empty data frame first 

- create 3 list using list comprehension

- list1= a values form 1 to 10

- list2= square of 1 to 10

- list3= cube of 1 to 10

- finally make a data frame

In [54]:
import pandas as pd
df1=pd.DataFrame()
df1

Empty DataFrame
Columns: []
Index: []

In [55]:
l1=[i for i in range(1,10)]
l2=[i**2 for i in range(1,10)]
l3=[i**3 for i in range(1,10)]
df1['Number']=l1
df1['Square']=l2
df1['Cube']=l3
df1

   X   Y    Z
0  1   1    1
1  2   4    8
2  3   9   27
3  4  16   64
4  5  25  125
5  6  36  216
6  7  49  343
7  8  64  512
8  9  81  729

**Step-6**

### upadate the already existed column

- create a new column

    - create a new list salary=[100000,200000,300000]

    - df['S']

    - creating a new column name is our choice

- update existing column are same way only

    - Here also we need a make a list of values  = number of rows

    - while updating the existing column

    - we need to provide already existed column name only

    - df['z']= list of values

In [56]:
# dataframe name: df1
# list of value values variable name:z
# which column we want to update :Z
z=[i**4 for i in range(1,10)]
df1['Z']=z
df1

   X   Y     Z
0  1   1     1
1  2   4    16
2  3   9    81
3  4  16   256
4  5  25   625
5  6  36  1296
6  7  49  2401
7  8  64  4096
8  9  81  6561

**Step-7**

**Drope the column**

In [57]:
# how to check the columns
df1.columns

Index(['X', 'Y', 'Z'], dtype='object')

- if you want to drop a specifics colums

- we will use drop methods

- we already know about difference between keywords and methods

- keywords will direclty

- Methods will use with corresponding dataframe

- **Method name:drop**

**df1.drop()**

- column: which colum you want to drop

- asix: Represents the specified value is a row or column

    - axis = 0 means rows

    - axis = 1 means column
 
    - by default axis = 0

- inplace: will provide overwirte the dataframe or not

    - inplace= true , this indicates overwrite the dataframe

    - inplace= false , the modified dataframe will be use when you provide 
                rew variable for the operation

In [45]:
df1.drop('x')
# we are not providing axis
# it assuming the provided values is a row
# By deflaut

KeyError: "['x'] not found in axis"

In [50]:
df1.drop('X',axis=1)

# after  this in a new cell type df1
# you will see original dataframe 
# because we did not provide inplace

# If you want to use below output
# you want to assign a variable 
# df_new=df1.drop('X',axis=1)

    Y     Z
0   1     1
1   4    16
2   9    81
3  16   256
4  25   625
5  36  1296
6  49  2401
7  64  4096
8  81  6561

In [51]:
df_new=df1.drop('X',axis=1,inplace=True)
df1

    Y     Z
0   1     1
1   4    16
2   9    81
3  16   256
4  25   625
5  36  1296
6  49  2401
7  64  4096
8  81  6561

In [ ]:
# read the data frame
# porvide the data 
# provide the columns names
# change tg index
# Add the new column
# MOdify the existing column
# DRop the column

**step-8**


**Drop the row**

- drop the column and drop the row both arer similar only 

-  the only difference is axis

    - axis = 0 represent rows 

    - by deafault axis = 0 available

    - which means if we provide any value , it will represnt rows only

In [3]:
# DataFrame name: df2
import pandas as pd
df2=pd.DataFrame()
l1=[i for i in range(1,10)]
l2=[i**2 for i in range(1,10)]
l3=[i**3 for i in range(1,10)]

df2['Number']=l1
df2['Square']=l2
df2['Cube']=l3

df2

   Number  Square  Cube
0       1       1     1
1       2       4     8
2       3       9    27
3       4      16    64
4       5      25   125
5       6      36   216
6       7      49   343
7       8      64   512
8       9      81   729

In [4]:
df2.drop(4)
# if we run this we will get error 
# by deafualt aixs = 0 which represents about
# But 'Number' is a column

# IF you want to drop row , the provide the row index

   Number  Square  Cube
0       1       1     1
1       2       4     8
2       3       9    27
3       4      16    64
5       6      36   216
6       7      49   343
7       8      64   512
8       9      81   729

In [5]:
# Multiple rows 
# Multiple columns keep always  in a list
df2.drop([4,8])

   Number  Square  Cube
0       1       1     1
1       2       4     8
2       3       9    27
3       4      16    64
5       6      36   216
6       7      49   343
7       8      64   512

In [6]:
df2.columns[[0,1]]

Index(['Number', 'Square'], dtype='object')

In [52]:
df2.drop([0,1],axis=1)
# [0,1] index
# axis =1 columns
# error

KeyError: '[0, 1] not found in axis'

**step-9**

**How to select the column**

In [7]:
df2['Number']
# series types 
# No column name display 
# whenever you see this type : series type

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
Name: Number, dtype: int64

In [8]:
df2[['Number']]
# data frame

   Number
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8
8       9

In [9]:
type(df2["Number"])

pandas.core.series.Series

In [10]:
type(df2[['Number']])

pandas.core.frame.DataFrame

In [11]:
df2.Number

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
Name: Number, dtype: int64

- df2['Number']: series type

- df2[['Number']]: dataFrame type

- df2.Number: series type

In [12]:
cols=['Number','Square']
df2[cols]

   Number  Square
0       1       1
1       2       4
2       3       9
3       4      16
4       5      25
5       6      36
6       7      49
7       8      64
8       9      81

In [13]:
df2['Number'].values

array([1, 2, 3, 4, 5, 6, 7, 8, 9], dtype=int64)

- All values comes in an array 

- Array means it is a list of element only represents using numpy package

- generally elements present in 3 ways

    - list : basic representation

    - Numpy : Array with Numpy package

    - Tensors : tensorflow package

    - torch : pytorch package

In [14]:
list1=[1,2,3,4]
list1

[1, 2, 3, 4]

In [15]:
import numpy as np
np.array(list1)

array([1, 2, 3, 4])

In [ ]:
tensor([1,2,,3,4])

In [17]:
list1=[1,2,3,4]
list2=[10,20,30,40]
list1+list2

[1, 2, 3, 4, 10, 20, 30, 40]

In [19]:
l1=np.array(list1)
l2=np.array(list2)
l1+l2

array([11, 22, 33, 44])

In [20]:
df2['Number'].values
# Images we worked on an Ml problem
# we got series of values
# with that series of values also we can create a dataframe

array([1, 2, 3, 4, 5, 6, 7, 8, 9], dtype=int64)

In [21]:
df2['NUMBER']=df2['Number'].values
df2

   Number  Square  Cube  NUMBER
0       1       1     1       1
1       2       4     8       2
2       3       9    27       3
3       4      16    64       4
4       5      25   125       5
5       6      36   216       6
6       7      49   343       7
7       8      64   512       8
8       9      81   729       9

**Step-10**

**How to save the dataframe**

- dataframe we can save in two format

     - csv : comma seperated values

    - xlsx : excel format

- In order to save any data

    - where you want to save : directory name

    - what is the name of the file for storing

    - what is the extension

- We alerady seeen same in the file handing session

**case-1** 

- saving file a same location 
- no need to provide directory path
- drictly give only name of the file
- and extension

In [23]:
# dataframe name: df2
df2.to_csv('Data1.csv')
df2.to_excel('Data1.xlsx')

**Step-11**

**How to read a Dataframe**

In [24]:
import pandas as pd
pd.read_csv('Data1.csv')

   Unnamed: 0  Number  Square  Cube  NUMBER
0           0       1       1     1       1
1           1       2       4     8       2
2           2       3       9    27       3
3           3       4      16    64       4
4           4       5      25   125       5
5           5       6      36   216       6
6           6       7      49   343       7
7           7       8      64   512       8
8           8       9      81   729       9

In [26]:
import pandas as pd
pd.read_excel('Data1.xlsx')

   Unnamed: 0  Number  Square  Cube  NUMBER
0           0       1       1     1       1
1           1       2       4     8       2
2           2       3       9    27       3
3           3       4      16    64       4
4           4       5      25   125       5
5           5       6      36   216       6
6           6       7      49   343       7
7           7       8      64   512       8
8           8       9      81   729       9

**Step-12**

**how to ovoid index column**

- while we save the dataframe 

- outomatically a new column will create 

- that we need to ovoid    

- permission denied mean close the data files from laptop

In [27]:
# dataframe name: df2
# save the data with out index column
df2.to_csv('Data1.csv',index=False)
df2.to_excel('Data1.xlsx',index=False)

In [28]:
import pandas as pd
pd.read_csv('Data1.csv')

   Number  Square  Cube  NUMBER
0       1       1     1       1
1       2       4     8       2
2       3       9    27       3
3       4      16    64       4
4       5      25   125       5
5       6      36   216       6
6       7      49   343       7
7       8      64   512       8
8       9      81   729       9

In [29]:
import pandas as pd
pd.read_excel('Data1.xlsx')

   Number  Square  Cube  NUMBER
0       1       1     1       1
1       2       4     8       2
2       3       9    27       3
3       4      16    64       4
4       5      25   125       5
5       6      36   216       6
6       7      49   343       7
7       8      64   512       8
8       9      81   729       9